{
  "audio_decoder_config": {
    "attention_o_bias": false,
    "attention_qk_norm": false,
    "attention_qkv_bias": false,
    "audio_hidden_dim": 5120,
    "dim": 2560,
    "dropout": 0.0,
    "head_dim": 128,
    "initializer_range": 0.01976423537605237,
    "intermediate_size": 9728,
    "max_seq_len": 11,
    "model_type": "fish_qwen3_audio_decoder",
    "moe_intermediate_size": 768,
    "n_head": 32,
    "n_layer": 4,
    "n_local_heads": 8,
    "norm_eps": 1e-06,
    "norm_topk_prob": true,
    "num_codebooks": 10,
    "num_experts": 1,
    "num_experts_per_tok": 1,
    "rope_base": 1000000,
    "router_gamma": 0.001,
    "text_dim": 2560,
    "tie_word_embeddings": false,
    "use_aux_loss_free": false,
    "use_bfloat16": false,
    "use_gradient_checkpointing": true,
    "use_moe": false,
    "vocab_size": 4096
  },
  "audio_pad_token_id": 151677,
  "dtype": "bfloat16",
  "eos_token_id": 151645,
  "model_type": "fish_qwen3_omni",
  "pad_token_id": 151669,
  "semantic_end_token_id": 155773,
  "semantic_start_token_id": 151678,
  "text_config": {
    "attention_o_bias": false,
    "attention_qk_norm": true,
    "attention_qkv_bias": false,
    "audio_hidden_dim": 5120,
    "dim": 2560,
    "dropout": 0.0,
    "head_dim": 128,
    "initializer_range": 0.01976423537605237,
    "intermediate_size": 9728,
    "max_seq_len": 32768,
    "model_type": "fish_qwen3",
    "moe_intermediate_size": 768,
    "n_head": 32,
    "n_layer": 36,
    "n_local_heads": 8,
    "norm_eps": 1e-06,
    "norm_topk_prob": true,
    "num_experts": 1,
    "num_experts_per_tok": 1,
    "rope_base": 1000000,
    "router_gamma": 0.001,
    "tie_word_embeddings": true,
    "use_aux_loss_free": false,
    "use_bfloat16": false,
    "use_gradient_checkpointing": true,
    "use_moe": false,
    "vocab_size": 155776
  },
  "transformers_version": "4.57.1"
}
