{
  "metadata": {
    "total_parameters": 4561852416,
    "total_size": 9123704832
  },
  "weight_map": {
    "audio_decoder.codebook_embeddings.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.embeddings.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.attention.wo.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.attention_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.0.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.attention.wo.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.attention_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.1.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.attention.wo.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.attention_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.2.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.attention.wo.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.attention_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.layers.3.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.norm.weight": "model-00002-of-00002.safetensors",
    "audio_decoder.output.weight": "model-00002-of-00002.safetensors",
    "text_model.model.embeddings.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.0.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.1.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.10.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.11.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.12.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.13.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.14.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.15.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.16.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.17.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.18.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.19.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.2.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.20.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.20.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.20.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.21.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.22.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.23.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.24.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.25.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.26.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.27.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.28.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.29.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.3.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.3.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.30.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.30.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.31.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.32.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.33.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.34.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.attention.k_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.attention.q_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.attention.wo.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.attention.wqkv.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.attention_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.feed_forward.w1.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.feed_forward.w2.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.feed_forward.w3.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.35.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "text_model.model.layers.4.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.4.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.5.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.6.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.7.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.8.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.attention.k_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.attention.q_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.attention.wo.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.attention.wqkv.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.attention_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.feed_forward.w1.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.feed_forward.w2.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.feed_forward.w3.weight": "model-00001-of-00002.safetensors",
    "text_model.model.layers.9.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "text_model.model.norm.weight": "model-00002-of-00002.safetensors"
  }
}
